; domain
(define (domain blocksworld-4ops)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob)) 
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob) 
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem BW-rand-12)
(:domain blocksworld-4ops)
(:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 )
(:init
(arm-empty)
(on-table b1)
(on-table b2)
(on b3 b5)
(on-table b4)
(on b5 b10)
(on b6 b12)
(on b7 b3)
(on-table b8)
(on b9 b11)
(on b10 b2)
(on b11 b4)
(on b12 b8)
(clear b1)
(clear b6)
(clear b7)
(clear b9)
)
(:goal
(and
(on b5 b1)
(on b7 b8)
(on b8 b5)
(on b11 b4)
(on b12 b11))
)
)

; plan
1. (unstack b7 b3)
   deleted: (on b7 b3) (clear b7) (arm-empty)
   added: (holding b7) (clear b3)
   goals met: 1 of 5
2. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 1 of 5
3. (unstack b3 b5)
   deleted: (on b3 b5) (clear b3) (arm-empty)
   added: (holding b3) (clear b5)
   goals met: 1 of 5
4. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 5
5. (unstack b5 b10)
   deleted: (on b5 b10) (clear b5) (arm-empty)
   added: (holding b5) (clear b10)
   goals met: 1 of 5
6. (stack b5 b1)
   deleted: (clear b1) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b1)
   goals met: 2 of 5
7. (unstack b9 b11)
   deleted: (on b9 b11) (clear b9) (arm-empty)
   added: (holding b9) (clear b11)
   goals met: 2 of 5
8. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 2 of 5
9. (unstack b6 b12)
   deleted: (on b6 b12) (clear b6) (arm-empty)
   added: (holding b6) (clear b12)
   goals met: 2 of 5
10. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 2 of 5
11. (unstack b12 b8)
   deleted: (on b12 b8) (clear b12) (arm-empty)
   added: (holding b12) (clear b8)
   goals met: 2 of 5
12. (stack b12 b11)
   deleted: (clear b11) (holding b12)
   added: (arm-empty) (clear b12) (on b12 b11)
   goals met: 3 of 5
13. (pickup b8)
   deleted: (clear b8) (on-table b8) (arm-empty)
   added: (holding b8)
   goals met: 3 of 5
14. (stack b8 b5)
   deleted: (clear b5) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b5)
   goals met: 4 of 5
15. (pickup b7)
   deleted: (clear b7) (on-table b7) (arm-empty)
   added: (holding b7)
   goals met: 4 of 5
16. (stack b7 b8)
   deleted: (clear b8) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b8)
   goals met: 5 of 5
